cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'caskroom/fonts'

brew 'coreutils'
brew 'ack'
brew 'grc'
brew 'node@8'
brew 'readline'
brew 'wget'
brew 'yarn'
brew 'nmap'
brew 'tree'
brew 'mas'
brew 'composer'
brew 'watchman'
brew 'bower'
brew 'hub'

cask 'hyper'
cask '1password'
cask 'karabiner-elements'
cask 'spotify'
cask 'sublime-text'
cask 'hipchat'
cask 'steam'
cask 'phpstorm'
cask 'google-chrome'
cask 'aerial'
cask 'font-fira-code'
cask 'macdown'

# Quick look plugins
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'quicklook-csv'
