cask_args appdir: '/Applications'

tap 'homebrew/bundle'

brew 'coreutils'
brew 'ack'
brew 'go'
brew 'grc'
brew 'node'
brew 'readline'
brew 'wget'
brew 'yarn'
brew 'nmap'
brew 'aws'
brew 'aws-shell'
brew 'youtube-dl'
brew 'tree'
brew 'mas'
brew 'homebrew/php/composer'

cask 'transmission'
cask 'hyper'
cask 'dropbox'
cask '1password'
cask 'bettertouchtool'
cask 'karabiner-elements'
cask 'spotify'
cask 'spacemonkey'
cask 'sublime-text'
cask 'virtualbox'
cask 'vagrant'
cask 'hipchat'
cask 'steam'
cask 'phpstorm'
cask 'whatsapp'
cask 'telegram'
cask 'querious'
cask 'sketch'
cask 'the-unarchiver'
cask 'teamviewer'
cask 'mplayerx'

# Quick look plugins
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'quicklook-csv'
